#+title: Elpaca User Manual
#+language: en
#+date: 2022-2023
#+author: Nicholas Vollmer

#+texinfo_filename: elpaca.texi
#+texinfo_deffn: t
#+texinfo_dir_category: Emacs
#+texinfo_dir_title: Elpaca: (elpaca).
#+texinfo_dir_desc: Elisp Package Manager
#+subtitle: version 0.0.0
#+texinfo: @noindent
#+options: creator: ':t html-postamble:nil H:5

#+include: "./common.org::introduction" :only-contents t

#+begin_quote
Copyright (C) 2022-2023 Nicholas Vollmer

You can redistribute this document and/or modify it under the terms of the GNU
General Public License as published by the Free Software Foundation, either
version 3 of the License, or (at your option) any later version.

This document is distributed in the hope that it will be useful,
but WITHOUT ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
General Public License for more details.
#+end_quote

#+include: "./common.org::installation" :minlevel 1

* UI
:PROPERTIES:
:DESCRIPTION: Elpaca's package management UI.
:CUSTOM_ID: ui
:END:
Elpaca has a UI mode available for managing packages.
The main entry points to the UI are the =elpaca-manager=, =elpaca-log=, and =elpaca-status= commands.
Each of these commands utilize =elpaca-ui-mode=.

The following commands are available in the =elpaca-ui-mode=:

#+begin_src emacs-lisp :lexical t :exports results :results table
(with-temp-buffer
  (require 'elpaca-process)
  (let ((program `(with-temp-buffer
                    (setq load-prefer-newer t)
                    (require 'elpaca-ui)
                    (describe-map-tree elpaca-ui-mode-map)
                    (princ (buffer-substring-no-properties (point-min) (point-max)))))
        print-level print-circle print-length)
    (insert
     (elpaca-process-output "emacs" "-Q" "-L" ".." "--batch" "--eval" (pp-to-string program))))
  (goto-char (point-min))
  (let (rows)
    (while (re-search-forward "elpaca" nil 'noerror)
      (push (split-string (buffer-substring-no-properties
                           (line-beginning-position) (line-end-position))
                          "\t+")
            rows))
    (setq rows (mapcar (lambda (it)
                         (append
                          (list (car (split-string
                                      (documentation (intern (cadr it)))
                                      "\n")))
                          it))
                       rows))
    (setq rows (cl-sort (mapcar #'nreverse rows) #'string< :key #'cadr))
    (push 'hline rows)
    (push (list "Command" "Binding" "Description") rows)
    rows))
#+end_src

#+RESULTS:
| Command                    | Binding | Description                                                     |
|----------------------------+---------+-----------------------------------------------------------------|
| elpaca-ui-send-input       | !       | Send input string to current process.                           |
| elpaca-ui-show-hidden-rows | +       | Append rows up to N times ‘elpaca-ui-row-limit’.                |
| elpaca-ui-search-installed | I       | Search for "#unique #installed"                                 |
| elpaca-ui-search-marked    | M       | Search for "#unique #marked"                                    |
| elpaca-ui-search-orphaned  | O       | Search for "#unique #orphan"                                    |
| elpaca-ui-search-refresh   | R       | Rerun the current search for BUFFER.                            |
| elpaca-ui-info             | RET     | Show info for current package.                                  |
| elpaca-ui-search-tried     | T       | Search for "#unique #installed !#declared"                      |
| elpaca-ui-unmark           | U       | Unmark current package.                                         |
| elpaca-ui-browse-package   | b       | Browse current package’s URL via ‘browse-url’.                  |
| elpaca-ui-copy             | c       | Copy formatted UI view ENTRIES to clipboard.                    |
| elpaca-ui-mark-delete      | d       | Mark package at point for ‘elpaca-delete’.                      |
| elpaca-ui-mark-fetch       | f       | Mark package at point for ‘elpaca-fetch’.                       |
| elpaca-ui-mark-try         | i       | Mark package at point for ‘elpaca-try’.                         |
| elpaca-log                 | l       | Display ‘elpaca-log-buffer’.                                    |
| elpaca-manager             | m       | Display elpaca’s package management UI.                         |
| elpaca-ui-mark-rebuild     | r       | Mark package at point for ‘elpaca-rebuild’.                     |
| elpaca-ui-search           | s       | Filter current buffer by QUERY. If QUERY is nil, prompt for it. |
| elpaca-status              | t       | Log most recent events for packages.                            |
| elpaca-ui-mark-merge       | u       | Mark package at point for ‘elpaca-merge’.                       |
| elpaca-ui-visit            | v       | Visit current package’s repo or BUILD directory.                |
| elpaca-ui-execute-marks    | x       | Execute each mark in ‘elpaca-ui-marked-packages’.               |

- Function: elpaca-manager =&optional recache= ::
  Display packages registered with Elpaca.
  Packages can searched for, installed, updated, rebuilt, and deleted from this interface.
  When =RECACHE= is non-nil, via lisp or interactively via the =universal-argument=, recompute Elpaca's menu item cache before display.

- Function: elpaca-log =&optional query= ::
  Display the log for queued packages filtered by =QUERY=.
  For acceptable values for =QUERY= see [[#searching][searching]].

- Function: elpaca-status ::
  Display the log for the most recent events for queued packages.
  This allows one to quickly determine the status and reason for the status of each queued package.

